In [1]:
# importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# importing customers csv

In [2]:
path = r'D:\DATA ANALYSIS\Achievement 4 project 29-04-2025\03 Scripts\original Folder\customers.csv'

In [4]:
path

'D:\\DATA ANALYSIS\\Achievement 4 project 29-04-2025\\03 Scripts\\original Folder\\customers.csv'

In [5]:
df_cust = pd.read_csv(os.path.join(path))

In [6]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
df_cust.rename(columns = {'Surnam' : 'surname'}, inplace = True)    # renaming columns

In [8]:
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [9]:
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [10]:
df_cust.rename(columns = {'First Name' : 'first name'}, inplace = True)

In [11]:
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [12]:
df_cust.head()

,user_id,first name,surname,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
df_cust.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

# checking for mixed types

In [14]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first name

In [15]:
df_cust['first name'] = df_cust['first name'].astype('str')    # converting to string

In [16]:
df_cust.isnull().sum()                   # checking for missing values

user_id         0
first name      0
surname         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [17]:
df_dups = df_cust[df_cust.duplicated()]     # looking for duplicates

In [18]:
df_dups

Empty DataFrame
Columns: [user_id, first name, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

# importing df_ords

In [19]:
path = r'D:\DATA ANALYSIS\Achievement 4 project 29-04-2025\03 Scripts\Prepared Folder\df_ords_new.pkl'

In [20]:
path

'D:\\DATA ANALYSIS\\Achievement 4 project 29-04-2025\\03 Scripts\\Prepared Folder\\df_ords_new.pkl'

In [21]:
df_ords_new = pd.read_pickle(os.path.join(path))

In [22]:
df_ords_new.head()

,Unnamed: 0.1,Unnamed: 0_x,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,...,"(slowest days,)",slowest days,busiest_period_of_day,max_order,loyalty_flag,avg_price_x,spending_flag,avg_price_y,median_days_since_prior_order,order_frequency_flag
0,0,0,2539329,1,1,2,8,NaN,196,1,...,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,6.367797,20.5,Non-frequent customer
1,1,1,2398795,1,2,3,7,15.0,196,1,...,slowest days,slowest days,Average orders,10,New customer,6.367797,Low spender,6.367797,20.5,Non-frequent customer
2,2,2,473747,1,3,3,12,21.0,196,1,...,slowest days,slowest days,Most orders,10,New customer,6.367797,Low spender,6.367797,20.5,Non-frequent customer
3,3,3,2254736,1,4,4,7,29.0,196,1,...,slowest days,slowest days,Average orders,10,New customer,6.367797,Low spender,6.367797,20.5,Non-frequent customer
4,4,4,431534,1,5,4,15,28.0,196,1,...,slowest days,slowest days,Most orders,10,New customer,6.367797,Low spender,6.367797,20.5,Non-frequent customer

In [23]:
df_ords_new.shape     #checking both dataframes

(32434212, 32)

In [24]:
df_cust.shape

(206209, 10)

In [25]:
df_ords_large = df_ords_new.merge(df_cust, on = 'user_id', indicator = 'True')

In [26]:
df_ords_large.head()

,Unnamed: 0.1,Unnamed: 0_x,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,...,first name,surname,gender,state,age,date_joined,n_dependants,fam_status,income,True
0,0,0,2539329,1,1,2,8,NaN,196,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,1,1,2398795,1,2,3,7,15.0,196,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,2,2,473747,1,3,3,12,21.0,196,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,3,3,2254736,1,4,4,7,29.0,196,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,4,4,431534,1,5,4,15,28.0,196,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [27]:
df_ords_large.shape

(32434212, 42)

In [28]:
path = r'D:\DATA ANALYSIS\Achievement 4 project 29-04-2025\03 Scripts\Prepared Folder'

In [29]:
df_ords_large.to_pickle(os.path.join(path, 'df_ords_large.pkl'))